Samsung/TizenRT/os/board/rtl8721csm/src/component/common/bluetooth/realtek/sdk/board/amebad/src/rtl8721d_bt_calibration.c
/* SPDX-License-Identifier: GPL-2.0 */
/* Copyright(c) 2018  Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#include <drv_types.h>
#include <hal_data.h>
#include "rtl8721d.h"
#include "rtl8721d_bt_calibration.h"

extern Rltk_wlan_t	rltk_wlan_info[NET_IF_NUM];

#define BTIQK_DELAY_TIME_8721D 10

#define MAX_TOLERANCE 5

#define BTIQK_BB_REG_NUM_8721D 16
#define BTIQK_RF_REG_NUM_8721D 6
#define BTIQK_MAC_REG_NUM_8721D 2
#define DBG_BT_CALIBRATION				(0) /* Debug log, default close */

#define BT_IQK_TOLERANCE				(2) /* Suggested by BT Jeffery */
#define BT_DCK_TOLERANCE				(1) /* Suggested by RDC BiChing */
#define BT_DCK_BIT_LEN					(9)
#define BT_IQK_BIT_LEN					(10)
#define BT_LOK_BIT_LEN					(6)
#define BT_IQK_CANDIDATE_NUM        (3)
#define BT_IQK_MAX_RETRY		    (2)

#define _ENABLE_DACDCK_BEFORE_IQK_
void
_btiqk_backup_bb_registers_8721d(struct dm_struct *dm,
				 u32 *adda_reg,
				 u32 *adda_backup,
				 u32 register_num)
{
	u32 i;

	for (i = 0; i < register_num; i++)
		adda_backup[i] = odm_get_bb_reg(dm, adda_reg[i], MASKDWORD);
}

void
_btiqk_backup_mac_registers_8721d(struct dm_struct *dm,
				  u32 *mac_reg,
				  u32 *mac_backup,
				  u32 register_num)
{
	u32 i;

	for (i = 0; i < register_num; i++)
		mac_backup[i] = odm_read_4byte(dm, mac_reg[i]);
}

void
_btiqk_backup_rf_registers_8721d(struct dm_struct *dm,
				 u32 *rf_reg,
				 u32 rf_reg_backup[][1],
				 u32 rf_reg_num)
{
	u32 i;

	for (i = 0; i < rf_reg_num; i++)
		rf_reg_backup[i][RF_PATH_A] = odm_get_rf_reg(dm, RF_PATH_A,
							     rf_reg[i],
							     RFREG_MASK);
}

void
_btiqk_reload_bb_registers_8721d(struct dm_struct *dm,
				 u32 *adda_reg,
				 u32 *adda_backup,
				 u32 regiester_num)
{
	u32 i;

	for (i = 0; i < regiester_num; i++)
		odm_set_bb_reg(dm, adda_reg[i], MASKDWORD, adda_backup[i]);
}

void
_btiqk_reload_mac_registers_8721d(struct dm_struct *dm,
				  u32 *mac_reg,
				  u32 *mac_backup,
				  u32 register_num)
{
	u32 i;

	RF_DBG(dm, DBG_RF_IQK, "[BTIQK] Reload MAC parameters !\n");
	for (i = 0; i < register_num; i++)
		odm_write_4byte(dm, mac_reg[i], mac_backup[i]);
}

void _btiqk_reload_rf_registers_8721d(struct dm_struct *dm,
				      u32 *rf_reg,
				      u32 rf_reg_backup[][1],
				      u32 rf_reg_num)
{
	u32 i;

	for (i = 0; i < rf_reg_num; i++) {
		odm_set_rf_reg(dm, RF_PATH_A, rf_reg[i], RFREG_MASK,
			       rf_reg_backup[i][RF_PATH_A]);
		RF_DBG(dm, DBG_RF_IQK, "[BTIQK] Reload RF_A 0x%x = 0x%x\n",
		       rf_reg[i], rf_reg_backup[i][RF_PATH_A]);
	}
}

int16_t signed_value_conversion(uint16_t val, uint8_t bit_len)
{
	int16_t sign_bit = 1 << (bit_len-1);
	int16_t value_mask = (1 << (bit_len-1)) - 1;
	if (val & sign_bit) { /* val < 0 */
		int16_t twos_complement_val = ((~val) & value_mask) + 1;
		return -(twos_complement_val);
	}
	else
		return val;
}

boolean
_btiqk_simularity_compare_8721d(struct dm_struct *dm,
				s32 result[][2],
				u8 c1,
				u8 c2)
{
	u32 i, j, diff, simularity_bit_map, bound = 2;
	boolean is_result = true;
	s32 tmp1 = 0, tmp2 = 0;

	RF_DBG(dm, DBG_RF_IQK,
	       "===> BTIQK:phy simularity compare 8721d c1 %d c2 %d!!!\n",
	       c1, c2);
	simularity_bit_map = 0;
	for (i = 0; i < bound; i++) {
		if (i == 1 || i == 3 || i == 5 || i == 7) {
			if ((result[c1][i] & 0x00000200) != 0)
				tmp1 = result[c1][i] | 0xFFFFFC00;
			else
				tmp1 = result[c1][i];

			if ((result[c2][i] & 0x00000200) != 0)
				tmp2 = result[c2][i] | 0xFFFFFC00;
			else
				tmp2 = result[c2][i];
		} else {
			tmp1 = result[c1][i];
			tmp2 = result[c2][i];
		}

		diff = (tmp1 > tmp2) ? (tmp1 - tmp2) : (tmp2 - tmp1);

		if (diff > MAX_TOLERANCE) {
			RF_DBG(dm, DBG_RF_IQK,
			       "BTIQK:differnece overflow %d index %d compare1 0x%x compare2 0x%x!!!\n",
			       diff, i, result[c1][i], result[c2][i]);
			simularity_bit_map = simularity_bit_map | (1 << i);
		}
	}

	RF_DBG(dm, DBG_RF_IQK,
	       "BTIQK:phy simularity compare 8721d simularity bit_map %x !!!\n",
	       simularity_bit_map);

	if (simularity_bit_map == 0)
		return is_result;

	if (!(simularity_bit_map & 0x03)) { /*path A TX OK*/
		for (i = 0; i < 2; i++)
			result[3][i] = result[c1][i];
	}

	return false;
}
boolean _btiqk_lok_8721d(void *dm_void, u32 *u32bt_iqk_x, u32 *u32bt_iqk_y, u32 *u32bt_dac_i, u32 *u32bt_dac_q)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	u32 btiqk_x, btiqk_y, r_tx_x, r_tx_y;
	u32 lok_result, btiqk_success = 0;
	u32 reg_eac, iqk_fail_bit, mac_reg4;
	u8 t = 0;

	RF_DBG(dm, DBG_RF_IQK, "[BTIQK] BTIQK:Start!!!");

	/*11_AD_TXIQK_LOK_20181024_SingleTone_polling*/
	odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xCCF400C0);
	odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
	odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
	odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x000000cb);/*AFE = BT*/
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x00800000);

	odm_set_rf_reg(dm, RF_PATH_A, RF_0xdf, 0x00040, 0x0);

	odm_set_bb_reg(dm, R_0xe30, MASKDWORD, 0x1400cc08);
	odm_set_bb_reg(dm, R_0xe34, MASKDWORD, 0x3800cc1b);
	odm_set_bb_reg(dm, R_0xe38, MASKDWORD, 0x821403ff);
	odm_set_bb_reg(dm, R_0xe3c, MASKDWORD, 0x28160000);
	odm_set_bb_reg(dm, R_0xe40, MASKDWORD, 0x01007c00);
	odm_set_bb_reg(dm, R_0xe44, MASKDWORD, 0x01004800);
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf8000800);
	odm_set_bb_reg(dm, R_0xe4c, MASKDWORD, 0x00402911);
	odm_set_bb_reg(dm, R_0xe4c, 0x00180000, 0x0);
	odm_set_bb_reg(dm, R_0xe50, MASKDWORD, 0x1000dc10);
	odm_set_bb_reg(dm, R_0xe54, MASKDWORD, 0x1000dc10);

	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, 0x40000, 0x1);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xdd, 0x00004, 0x1);
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x03000, 0x3);/*DAC Gain*/
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x00e00, 0x2);/*IPA Gain*/
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x001e0, 0x3);/*PAD Gain*/
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x0001f, 0x3);/*TXBB Gain*/
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x18, 0x30000, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, 0x01, 0x00004, 0x1);/*RF GNT_BT = 1*/

	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x80800000);

	mac_reg4 = odm_read_4byte(dm, 0x4);/*Shut down DAI*/
	odm_write_4byte(dm, 0x4, mac_reg4 & ~(BIT(31)));
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xfa000800);
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf8000800);
	while ((odm_get_bb_reg(dm, R_0xeac, BIT(26)) != 1) && (t < 20)) {
		ODM_delay_ms(1);
		t++;
	}
	odm_write_4byte(dm, 0x4, mac_reg4);/*Enable DAI*/
	/*12_Read_Tx_X_Tx_Y*/
	btiqk_x = odm_get_bb_reg(dm, R_0xe94, 0x03ff0000);
	btiqk_y = odm_get_bb_reg(dm, R_0xe9c, 0x03ff0000);
	RF_DBG(dm, DBG_RF_IQK,
	       "[BTIQK] btiqk_x = 0x%x, btiqk_y = 0x%x, iqk end = 0x%x/n",
	       btiqk_x, btiqk_y, odm_get_bb_reg(dm, R_0xeac, BIT(26)));

    *u32bt_iqk_x = btiqk_x;
    *u32bt_iqk_y = btiqk_y;

	/* Check failed */
	reg_eac = odm_get_bb_reg(dm, R_0xeac, MASKDWORD);
	iqk_fail_bit = odm_get_bb_reg(dm, R_0xeac, 0x10000000);
	RF_DBG(dm, DBG_RF_IQK, "[BTIQK] 0xeac = 0x%x,eacBIT28=0x%x\n", reg_eac,
	       iqk_fail_bit);
	/*monitor image power before & after IQK*/
	RF_DBG(dm, DBG_RF_IQK,
	       "[BTIQK] 0xe90(before IQK)= 0x%x, 0xe98(afer IQK) = 0x%x\n",
	       odm_get_bb_reg(dm, R_0xe90, MASKDWORD),
	       odm_get_bb_reg(dm, R_0xe98, MASKDWORD));
#if 1
	/*13_Read_IQDAC, re read/write rf08 means enable writing_table*/
	r_tx_x = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0xfc000);
	r_tx_y = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003f0);
	lok_result = (r_tx_x << 6) | (r_tx_y);

    *u32bt_dac_i = r_tx_x;
    *u32bt_dac_q = r_tx_y;
#endif
	/*14_restore_BTRF_setting_20181024*/
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x00000000);

	odm_set_rf_reg(dm, RF_PATH_A, RF_0xdd, 0x00004, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, 0x40000, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, 0x01, 0x00004, 0x0);

