Samsung/TizenRT/os/board/rtl8721csm/src/component/common/bluetooth/realtek/sdk/board/amebad/src/rtl8721d_bt_calibration.c
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x00000003);

	if (!(reg_eac & BIT(28)) &&
	    (((btiqk_x & 0x03FF0000) >> 16) != 0x142) &&
	    (((btiqk_y & 0x03FF0000) >> 16) != 0x42))
	{
		btiqk_success |= 0x01;
#if DBG_BT_CALIBRATION 
        DBG_8195A("the IQK and LOK procedure is done");	/* success != workable */
#endif
	}
	else
	{
#if DBG_BT_CALIBRATION 
        DBG_8195A("the IQK and LOK procedure is fail");
#endif
		RF_DBG(dm, DBG_RF_IQK, "[BTIQK] pathA TX IQK is fail!\n");
	}

	return btiqk_success;
}

void sort_iqk(u32* iqk_array, int num)
{
	u32 temp;
	int i, j;
	short int val_i, val_j;

	for (i = 0; i < (num - 1); i++) {
		val_i = signed_value_conversion(iqk_array[i], BT_IQK_BIT_LEN);
		for (j = (i + 1); j < num; j++) {
			val_j = signed_value_conversion(iqk_array[j], BT_IQK_BIT_LEN);
			if (val_i > val_j) {
				temp = iqk_array[i];
				iqk_array[i] = iqk_array[j];
				iqk_array[j] = temp;
				val_i = signed_value_conversion(iqk_array[i], BT_IQK_BIT_LEN);
			}
		}
	}
}

void sort_lok(u16* lok_array, int num)
{
	u16 temp;
	int i, j;

	for (i = 0; i < (num - 1); i++) {
		for (j = (i + 1); j < num; j++) {
			if (lok_array[i] > lok_array[j]) {
				temp = lok_array[i];
				lok_array[i] = lok_array[j];
				lok_array[j] = temp;
			}
		}
	}
}

bool bt_calibration_similar(u16 a, u16 b, u8 bit_len, u8 tolerance, bool signed_val)
{
	short int val_a = (signed_val)? signed_value_conversion(a, bit_len): a;
	short int val_b = (signed_val)? signed_value_conversion(b, bit_len): b;

	short int diff = (val_a > val_b) ? (val_a - val_b) : (val_b - val_a);

	if (diff <= tolerance) {
		return true;
	}
	else {
		return false;
	}
}

bool select_iqk(u32* iqk_array, int num, u32* selected)
{
	u8 median_idx = (num/2);
	sort_iqk(iqk_array, num);

	if (bt_calibration_similar(iqk_array[0], iqk_array[num-1], BT_IQK_BIT_LEN, BT_IQK_TOLERANCE, true))
	{
		*selected = iqk_array[median_idx];
		return true;
	}
	else {
		return false;
	}
}



bool select_lok(u16* lok_array, int num, u32* selected)
{
	uint8_t median_idx = (num/2);

	sort_lok(lok_array, num);

	if (bt_calibration_similar(lok_array[0], lok_array[num-1], BT_LOK_BIT_LEN, BT_IQK_TOLERANCE, false))
	{
		*selected = lok_array[median_idx];
		return true;
	}
	else {
		return false;
	}

}

void
_btiqk_retry_8721d(struct dm_struct *dm,
		   u32 result[])
{
	u32 i;
	u8 path_aok = 0;

#if MP_DRIVER
	const u32 retry_count = 3;
#else
	const u32 retry_count = 2;
#endif

    u32 btiqk_x, btiqk_y, btlok_i, btlok_q;

	int candidate_num = BT_IQK_CANDIDATE_NUM;
	BT_Cali_TypeDef defaul_value = {0x100,0x00,0x20,0x20}; /* default value */
	BT_Cali_TypeDef selected = defaul_value;
	u32 iqk_array[2][BT_IQK_CANDIDATE_NUM]; /* IQK_XX, IQK_YY */
	u16 lok_array[2][BT_IQK_CANDIDATE_NUM]; /* QDAC, IDAC */
	bool calibration_valid[4] = {true, true, true, true};			/* IQK_XX, IQK_YY, QDAC, IDAC */
	bool calibration_status[4] = {false, false, false, false};	/* IQK_XX, IQK_YY, QDAC, IDAC */
	bool calibration_all_vaid = false;
	const char *name[]  = {"IQK_xx","IQK_yy","QDAC","IDAC"};
	int iqk_cnt = 0;

	while ( (!calibration_all_vaid) && (iqk_cnt < BT_IQK_MAX_RETRY) ) {
		/* Do calibration */
		iqk_cnt ++;
		for(i=0; i < BT_IQK_CANDIDATE_NUM; i++) {
			path_aok = _btiqk_lok_8721d(dm, &btiqk_x, &btiqk_y, &btlok_i, &btlok_q);

			iqk_array[0][i] = btiqk_x;
			iqk_array[1][i] = btiqk_y;
			lok_array[0][i] = btlok_i;
			lok_array[1][i] = btlok_q;
#if DBG_BT_CALIBRATION
			DBG_8195A("\n\r[BT IQK loop][%d] IQK_xx = 0x%x, IQK_yy = 0x%x, IDAC = 0x%x, QDAC = 0x%x\n",
				   i, iqk_array[0][i], iqk_array[1][i], lok_array[0][i], lok_array[1][i]);
#endif

		}

		/* Check IQK candidate range <= BT_IQK_TOLERANCE indivdually */
		for(i = 0; i < 2; i++) {
			if (calibration_status[i] == false) {
				u32* iqk_ptr = (i==0)? (&selected.IQK_xx) : (&selected.IQK_yy);
				calibration_status[i] = select_iqk(iqk_array[i], BT_IQK_CANDIDATE_NUM, iqk_ptr);
			}
		}

		/* Check LOK candidate range <= BT_IQK_TOLERANCE indivdually */
		for(i = 0; i < 2; i++) {

			if (calibration_status[i+2] == false)
            {
				u32* lok_ptr = (i==0)? (&selected.IDAC) : (&selected.QDAC);
				calibration_status[i+2] = select_lok(lok_array[i], candidate_num, lok_ptr);
			}

		}

#if DBG_BT_CALIBRATION
        DBG_8195A("\n\r %x, %x, %x, %x\n", calibration_status[0], calibration_status[1], calibration_status[2], calibration_status[3]);
        DBG_8195A("\n\r %x, %x, %x, %x\n", calibration_valid[0], calibration_valid[1], calibration_valid[2], calibration_valid[3]);
#endif

		if (!memcmp(calibration_status, calibration_valid, sizeof(calibration_status))) {
			/* All calibration done, exit retry loop */
			calibration_all_vaid = true;
			break;
		}
		else {

#if DBG_BT_CALIBRATION
			DBG_8195A("\n\r***********************[IQK FAIL]***********************");
			/* Debug MSG */
			for(i=0; i<4; i++) {
				if (!calibration_status[i]) {
					DBG_8195A("\n\r[BT IQK][%d] %s fail\n", i, name[i]);
				}
			}
#endif

		}

	}
#if 1
	if (!calibration_all_vaid) {
#if DBG_BT_CALIBRATION
		DBG_8195A("\n\r***********************[_IQK_]***********************");
#endif
		for(i=0; i<4; i++) {
			if (!calibration_status[i]) {
				DBG_8195A("\n\r[BT IQK][Warning] %s fail, use default value", name[i]);
			}
		}
	}

#if DBG_BT_CALIBRATION
	DBG_8195A("\n\r[BT IQK][Selected] IQK_xx = 0x%x, IQK_yy = 0x%x, IDAC = 0x%x, QDAC = 0x%x\n",
		   selected.IQK_xx, selected.IQK_yy, selected.IDAC, selected.QDAC);
#endif

    result[0] = selected.IQK_xx;
    result[1] = selected.IQK_yy;
    result[2] = selected.IDAC;
    result[3] = selected.QDAC;

#endif
	RF_DBG(dm, DBG_RF_IQK, "%s <==\n", __func__);
}

u32
_btiqk_return_result_8721d(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
    u32 result[4];

    _btiqk_retry_8721d(dm, result);
    return (result[0]<<22)|(result[1]<<12)|(result[2]<<6)|(result[3]<<0);
}

