Samsung/TizenRT/os/board/rtl8721csm/src/component/common/bluetooth/realtek/sdk/board/amebad/src/rtl8721d_bt_calibration.c
void phy_bt_lok_write_8721d(struct dm_struct *dm,
			    u32 idac,
			    u32 qdac)
{
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, BIT18, 0x1);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x1, BIT2, 0x1);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0xfc000, idac);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003f0, qdac);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x1, BIT2, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, BIT18, 0x0);
}

#if 1
void phy_bt_adda_dck_8721d(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
    u32 t = 0, dck_cnt = 0;
    u8 dck_ok = 0;
	u16 adci, adcq, dai_adci, daq_adcq;

	RF_DBG(dm, DBG_RF_IQK, "[BT DCK]ADC offset mark off!!");
	while (!dck_ok) {
	/*01_DAC_DCK_ADC_offset_mark_off_20181024*/
	odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);
	odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
	odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
	odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);

	odm_set_bb_reg(dm, R_0x950, 0x01ff01ff, 0x00);

	odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);

	odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);


	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);	/* RX BB to AD off */
		ODM_delay_ms(25);  /* without this delay, BT LOK may fail (still don't know why) (Debugged with RDC BiChing) */

	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);

	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);

	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);


	odm_set_bb_reg(dm, R_0xe28, 0x00000008, 0x1);

	odm_set_bb_reg(dm, R_0xe48, 0x00f00000, 0x1);

	odm_set_bb_reg(dm, R_0xe48, 0x00000002, 0x0);

	odm_set_bb_reg(dm, R_0x908, 0x00000fff, 0x300);


	odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x0);
	ODM_delay_us(1);

	odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x1);


	/* read 0xdf4[9:1]    ADCI offset */
	adci = odm_get_bb_reg(dm, R_0xdf4, 0x000003FE);
	/* read 0xdf4[31:23]  ADCQ offset */
	adcq = odm_get_bb_reg(dm, R_0xdf4, 0xFF800000);
	RF_DBG(dm, DBG_RF_IQK, "[BT DCK]BT DAC mark off!!");

	/*04_DAC_DCK_mark_off_20181024*/
		odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);

		odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);

		odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);

		odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);

		odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);

		odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);

		odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);

	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);

	odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);

	odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);


	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);

	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x0);

	odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x0);

	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);

	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x1);


		ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x988, MASKDWORD, 0x0003FFF0);

	odm_set_bb_reg(dm, R_0x98c, MASKDWORD, 0x00000000);

	odm_set_bb_reg(dm, R_0x994, MASKDWORD, 0x0003FFF0);

	odm_set_bb_reg(dm, R_0x998, MASKDWORD, 0x00000000);


	odm_set_bb_reg(dm, R_0x988, 0x80000000, 0x1);

	odm_set_bb_reg(dm, R_0x994, 0x80000000, 0x1);

	odm_set_bb_reg(dm, R_0x988, 0x40000000, 0x0);

	odm_set_bb_reg(dm, R_0x994, 0x40000000, 0x0);

	ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x988, 0x00000001, 0x1);	/* pow_da_I_CR */

	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x1);	/* pow_da_Q_CR */

	ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x988, 0x00000002, 0x1);	/* cal_os_I_CR */

	odm_set_bb_reg(dm, R_0x994, 0x00000002, 0x1);	/* cal_os_Q_CR */


		ODM_delay_us(350);
		while ((odm_get_bb_reg(dm, 0xfec, BIT31) != 1) && (t < 1000)) {
			ODM_delay_us(5);
			t += 5;
		}
	odm_set_bb_reg(dm, R_0x988, 0x00000001, 0x0);	/* pow_da_I_CR */
		while ((odm_get_bb_reg(dm, 0xff8, BIT31) != 1) && (t < 1000)) {
			ODM_delay_us(5);
			t += 5;
		}
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x0);	/* pow_da_Q_CR */
		/* read 0xdf4[9:1]    ADCI offset */
		dai_adci = odm_get_bb_reg(dm, R_0xdf4, 0x000003FE);
		/* read 0xdf4[31:23]  ADCQ offset */
		daq_adcq = odm_get_bb_reg(dm, R_0xdf4, 0xFF800000);
	/*return to normal setting*/
	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);

	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x0);

	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);


	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x00000003);

	dck_cnt++;

		if ((bt_calibration_similar(adci, dai_adci, BT_DCK_BIT_LEN, BT_DCK_TOLERANCE, true))
			 && (bt_calibration_similar(adcq, daq_adcq, BT_DCK_BIT_LEN, BT_DCK_TOLERANCE, true)))
		{
#if DBG_BT_CALIBRATION
			DBG_8195A("\n\r[BT DCK][%d] DCK OK: ", dck_cnt);
			DBG_8195A("ADCI = %x, ADCQ = %x, DAI_ACDI = %x, DAQ_ADCQ = %x",
				   adci, adcq, dai_adci, daq_adcq);
#endif
			dck_ok = 1;
		}
		else {
#if DBG_BT_CALIBRATION
			DBG_8195A("\n\r***********************[DCK Error]***********************");
			DBG_8195A("\n\r[BT DCK][%d] DCK fail: ", dck_cnt);
			DBG_8195A("ADCI = %x, ADCQ = %x, DAI_ACDI = %x, DAQ_ADCQ = %x",
				   adci, adcq, dai_adci, daq_adcq);
#endif
			dck_ok = 0;
			if (dck_cnt == 100) {
				DBG_8195A("\n\r[BT DCK] DCK Error 100 times. Please reboot.");
				while (1);
			}
		}

	}
#if DBG_BT_CALIBRATION
    DBG_8195A("\n\r[BT DCK] DCK run %d time(s) %s", dck_cnt, dck_ok? "OK":"FAIL");
#endif

u32 reg_tmp0, reg_tmp1, reg_tmp2, reg_tmp3;

reg_tmp0 = 0xFE000000&(odm_get_bb_reg(dm, 0xFE4, MASKDWORD));
reg_tmp1 = 0x0000001F&(odm_get_bb_reg(dm, 0xFE8, MASKDWORD));
reg_tmp2 = 0xFE000000&(odm_get_bb_reg(dm, 0xFF0, MASKDWORD));
reg_tmp3 = 0x0000001F&(odm_get_bb_reg(dm, 0xFF4, MASKDWORD));

#if DBG_BT_CALIBRATION
DBG_8195A("DCK result 0x%08x, 0x%08x, 0x%08x, 0x%08x\n", reg_tmp0, reg_tmp1, reg_tmp2, reg_tmp3);
#endif

