Samsung/TizenRT/os/board/rtl8721csm/src/component/common/bluetooth/realtek/sdk/board/amebad/src/rtl8721d_bt_calibration.c
}
#else
void phy_bt_adc_dck_8721d(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	struct dm_rf_calibration_struct *cali_info = &dm->rf_calibrate_info;

	RF_DBG(dm, DBG_RF_IQK, "[BT DCK]ADC offset mark off!!");

	/*01_DAC_DCK_ADC_offset_mark_off_20181024*/
	odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);
	odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
	odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
	odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);

	odm_set_bb_reg(dm, R_0x950, 0x01ff01ff, 0x00);
	odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);
	odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);
	odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x1);
	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);
	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);

	odm_set_bb_reg(dm, R_0xe28, 0x00000008, 0x1);
	odm_set_bb_reg(dm, R_0xe48, 0x00f00000, 0x1);
	odm_set_bb_reg(dm, R_0xe48, 0x00000002, 0x0);
	odm_set_bb_reg(dm, R_0x908, 0x00000fff, 0x300);

	odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x0);
	ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x1);
}

void phy_bt_dac_dck_8721d(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	struct dm_rf_calibration_struct *cali_info = &dm->rf_calibrate_info;

	RF_DBG(dm, DBG_RF_IQK, "[BT DCK]BT DAC mark off!!");

	/*04_DAC_DCK_mark_off_20181024*/
	odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);
	odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
	odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
	odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);

	odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);
	odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);

	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x1);
	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);
	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x1);

	odm_set_bb_reg(dm, R_0x988, MASKDWORD, 0x0003FFF0);
	odm_set_bb_reg(dm, R_0x98c, MASKDWORD, 0x00000000);
	odm_set_bb_reg(dm, R_0x994, MASKDWORD, 0x0003FFF0);
	odm_set_bb_reg(dm, R_0x998, MASKDWORD, 0x00000000);

	odm_set_bb_reg(dm, R_0x988, 0x80000000, 0x1);
	odm_set_bb_reg(dm, R_0x994, 0x80000000, 0x1);
	odm_set_bb_reg(dm, R_0x988, 0x40000000, 0x0);
	odm_set_bb_reg(dm, R_0x994, 0x40000000, 0x0);

	ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x988, 0x00000001, 0x1);	/* pow_da_I_CR */
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x1);	/* pow_da_Q_CR */
	ODM_delay_us(1);
	odm_set_bb_reg(dm, R_0x988, 0x00000002, 0x1);	/* cal_os_I_CR */
	odm_set_bb_reg(dm, R_0x994, 0x00000002, 0x1);	/* cal_os_Q_CR */

	odm_set_bb_reg(dm, R_0x988, 0x00000001, 0x0);	/* pow_da_I_CR */
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x0);	/* pow_da_Q_CR */
	/*return to normal setting*/
	odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x1);
	odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);
	odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);
	odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x0);
	odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);

	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x00000003);
}

#endif

void phy_bt_dck_write_8721d(struct dm_struct *dm,
			    u8 q_dck,
			    u8 i_dck)
{
	odm_set_bb_reg(dm, R_0x998, 0x00000001, 0x1);
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x1);

	odm_set_bb_reg(dm, R_0x98c, 0x01000000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x01000000, 1);
	odm_set_bb_reg(dm, R_0x98c, 0x00200000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x00200000, 1);
	odm_set_bb_reg(dm, R_0x98c, 0x02000000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x02000000, 1);

	odm_set_bb_reg(dm, R_0x98c, 0x00007c00, 0x1f);
	odm_set_bb_reg(dm, R_0x98c, 0x00000200, 0x1);

	odm_set_bb_reg(dm, R_0x98c, 0x001F8000, i_dck);

	odm_set_bb_reg(dm, R_0x998, 0x00007c00, 0x1f);
	odm_set_bb_reg(dm, R_0x998, 0x00000200, 0x1);

	odm_set_bb_reg(dm, R_0x998, 0x001F8000, q_dck);

	odm_set_bb_reg(dm, R_0x998, 0x00000001, 0x0);
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x0);
}

u32 phy_btiq_calibrate_8721d(struct dm_struct *dm)
{
	u32 result;
	u32 bt_rf_backup[BTIQK_RF_REG_NUM_8721D][1];
	u32 bt_bb_backup[BTIQK_BB_REG_NUM_8721D];
	u32 bt_mac_backup[BTIQK_MAC_REG_NUM_8721D];

	u32 BTIQK_BB_REG_8721D[] = { R_0xc80, R_0x88c, R_0xe6c, R_0xe70,
		R_0xc04, R_0xc08, R_0x874, R_0x888, R_0xe28, R_0xe30, R_0xe34,
		R_0xe38, R_0xe3c, R_0xe40, R_0xe44,R_0xb00 };
	u32 BTIQK_RF_REG_8721D[][1] = { RF_0x0, RF_0x1, RF_0x18, RF_0xdf,
		RF_0xdd, RF_0xee };
	u8 i = 0;
	u8 pta_poll = 100;
	RF_DBG(dm, DBG_RF_IQK, "[BTIQK]==========IQK strat!!!!!==========\n");

	_btiqk_backup_bb_registers_8721d(dm, BTIQK_BB_REG_8721D, bt_bb_backup,
					 BTIQK_BB_REG_NUM_8721D);
	_btiqk_backup_rf_registers_8721d(dm, (uint32_t *)BTIQK_RF_REG_8721D,
					 bt_rf_backup, BTIQK_RF_REG_NUM_8721D);

	/*Switch to wifi temporary, will move to wifi driver later*/
	/*Set gnt bt to 0 to force to wifi*/
	while(!btc_set_gnt_bt_atmoic_8721d(1, 0) && pta_poll){
		pta_poll--;
		vTaskDelay(10);
	}

	/*WIFI DPK&&IQK OFF*/
	odm_set_bb_reg(dm, R_0xb00, 0x80, 0);
	
	ODM_delay_ms(BTIQK_DELAY_TIME_8721D);

#if DBG_BT_CALIBRATION
u32 reg_tmp;

reg_tmp = odm_get_bb_reg(dm, 0x88C, MASKDWORD);
DBG_8195A("original 0x88C = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xC80, MASKDWORD);
DBG_8195A("original 0xC80 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe6c, MASKDWORD);
DBG_8195A("original 0xe6c = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0x670, MASKDWORD);
DBG_8195A("original 0x670 = 0x%08x\n", reg_tmp);

