Samsung/TizenRT/os/board/rtl8721csm/src/component/common/bluetooth/realtek/sdk/board/amebad/src/rtl8721d_bt_calibration.c
reg_tmp = odm_get_bb_reg(dm, 0xc04, MASKDWORD);
DBG_8195A("original 0xc04 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xc08, MASKDWORD);
DBG_8195A("original 0xc08 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0x874, MASKDWORD);
DBG_8195A("original 0x874 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0x888, MASKDWORD);
DBG_8195A("original 0x888 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe28, MASKDWORD);
DBG_8195A("original 0xe28 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, RF_0xdf, MASKDWORD);
DBG_8195A("original RF_0xdf = 0x%08x\n", reg_tmp);


reg_tmp = odm_get_bb_reg(dm, 0xe30, MASKDWORD);
DBG_8195A("original 0xe30 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe34, MASKDWORD);
DBG_8195A("original 0xe34 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe38, MASKDWORD);
DBG_8195A("original 0xe38 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe3C, MASKDWORD);
DBG_8195A("original 0xe3C = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe40, MASKDWORD);
DBG_8195A("original 0xe40 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe44, MASKDWORD);
DBG_8195A("original 0xe44 = 0x%08x\n", reg_tmp);


reg_tmp = odm_get_bb_reg(dm, 0xe48, MASKDWORD);
DBG_8195A("original 0xe48 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe4c, MASKDWORD);
DBG_8195A("original 0xe4c = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe50, MASKDWORD);
DBG_8195A("original 0xe50 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_bb_reg(dm, 0xe54, MASKDWORD);
DBG_8195A("original 0xe54 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, RF_0xee, MASKDWORD);
DBG_8195A("original RF_0xee = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, RF_0xdd, MASKDWORD);
DBG_8195A("original RF_0xdd = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, 0x06, MASKDWORD);
DBG_8195A("original rf 0x06 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, RF_0x18, MASKDWORD);
DBG_8195A("original RF_0x18 = 0x%08x\n", reg_tmp);

reg_tmp = odm_get_rf_reg(dm, RF_PATH_A, 0x01, MASKDWORD);
DBG_8195A("original rf 0x01 = 0x%08x\n", reg_tmp);
#endif

	result = _btiqk_return_result_8721d(dm);
	_btiqk_reload_rf_registers_8721d(dm, (uint32_t *)BTIQK_RF_REG_8721D,
					 bt_rf_backup, BTIQK_RF_REG_NUM_8721D);
	_btiqk_reload_bb_registers_8721d(dm, BTIQK_BB_REG_8721D, bt_bb_backup,
					 BTIQK_BB_REG_NUM_8721D);
	
	/*Atmoic operation done*/
	btc_set_gnt_bt_atmoic_8721d(0, 0);
	
	RF_DBG(dm, DBG_RF_IQK, "[BTIQK]delay 10ms!!!\n");
	ODM_delay_ms(BTIQK_DELAY_TIME_8721D);

	RF_DBG(dm, DBG_RF_IQK, "[BTIQK]==========IQK end!!!!!==========\n");
	return result;
}

void phy_bt_flatk_8721d(struct dm_struct *dm, u16 txgain_flatk)
{
	u8 txgain_flak_use;
	u8 txgaink_flag ;
	u8 temp = 0;

	txgaink_flag = (signed_value_conversion((txgain_flatk>>0&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>4&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>8&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>12&0x0f), 4) <= 2);

	odm_set_rf_reg(dm, RF_PATH_A, RF_0xed, 0x40, 0x1);
	for(int i = 0; i<4; i++) {
		odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT(12)|BIT(13), i);
		txgain_flak_use = (txgain_flatk>>(i*4)) & 0x0f ;
		if(txgaink_flag)
			txgain_flak_use +=2;
		if(txgain_flak_use == 0x07)
			txgain_flak_use =0x06;
		temp = (((txgain_flak_use>>1) + (txgain_flak_use&0x01)) & 0x07);
		if(temp == 0x07)
			odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT2|BIT1|BIT0, 0x05);
		else if(temp == 0x05)
			odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT2|BIT1|BIT0, 0x07);
		else if(temp == 0x04)
			odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT2|BIT1|BIT0, 0x07);
		else
			odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT2|BIT1|BIT0, temp);
	}
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xed, 0x40, 0x0);
}



u32 bt_iqk_8721d(BT_Cali_TypeDef *cal_data, BOOLEAN store)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 result;
	u32 ret = _SUCCESS;

	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);

		result = phy_btiq_calibrate_8721d(&(pHalData->odmpriv));

		/* get calibration data */
		if(cal_data) {
			cal_data->IQK_xx = (result >> 22) & 0x3FF;
			cal_data->IQK_yy = (result >> 12) & 0x3FF;
			cal_data->IDAC = (result >> 6) & 0x3F;
			cal_data->QDAC = (result >> 0) & 0x3F;
		}

	} else {
		ret =_FAIL;
		DBG_ERR("netif is DOWN");
	}
return ret;
}

u32 bt_adda_dck_8721d(void)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 ret = _SUCCESS;

	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		if (Hal_BT_Is_Supported(padapter) == _FALSE)
			HAL_READ8(0,0);	/* creat a hardfault to limit some comusters use bt */
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);

		phy_bt_adda_dck_8721d(&(pHalData->odmpriv));

	} else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}

	return ret;
}

u32 bt_lok_write(u32 idac, u32 qdac)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 ret = _SUCCESS;

	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		if (Hal_BT_Is_Supported(padapter) == _FALSE)
			HAL_READ8(0,0);	/* creat a hardfault to limit some comusters use bt */
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);

		phy_bt_lok_write_8721d(&(pHalData->odmpriv),idac,qdac);
	} else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}

	return ret;
}

u32 bt_dck_write(u8 q_dck, u8 i_dck)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 ret = _SUCCESS;
		
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		if (Hal_BT_Is_Supported(padapter) == _FALSE)
			HAL_READ8(0,0);	/* creat a hardfault to limit some comusters use bt */
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);

		phy_bt_dck_write_8721d(&(pHalData->odmpriv),q_dck,i_dck);
	} else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}

	return ret;
}

u32 bt_flatk_8721d(u16 txgain_flatk)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 ret = _SUCCESS;

	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		if (Hal_BT_Is_Supported(padapter) == _FALSE)
			HAL_READ8(0,0);	/* creat a hardfault to limit some comusters use bt */
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);

		phy_bt_flatk_8721d(&(pHalData->odmpriv), txgain_flatk);

	} else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}

	return ret;
}
